/********************************************************************************
 * (c) Copyright 2017-2020, LME, All Rights Reserved。
 * THIS IS UNPUBLISHED PROPRIETARY SOURCE CODE OF LME, INC。
 * The copyright notice above does not evidence any actual or intended
 * publication of such source code。
 *
 * FileName    : UappsBlK.c
 * Author      :
 * Date        : 2020-05-09
 * Version     : 1.0
 * Description : APS层的分块处理的源文件
 *             :
 * Others      :
 * ModifyRecord:
 *
********************************************************************************/
#include "Common.h"
#include "Uapps.h"


/**********************************宏定义 开始*************************************/


/**********************************宏定义 结束*************************************/


/**********************************枚举声明 开始************************************/

/**********************************枚举声明 结束************************************/


/**********************************结构体声明 开始***********************************/


/**********************************结构体声明 结束***********************************/


/**********************************静态变量声明 开始**********************************/


/**********************************静态变量声明 结束**********************************/

/***********************************函数声明 开始***********************************/

/**
 * Construct SIZE struct
 */
/*--------------------------------------------------------------
函数名称：NewBlock
函数功能：生成新的分块结构体。
输入参数：bf-分块标志
        blkn-分块序号
        len-分块数据的长度
输出参数：blk-分块结构体指针
返回值：无
备 注：
---------------------------------------------------------------*/
void NewBlock(UappsBlk_t *blk, u8 bf, u8 blkn, u16 len)
{
	blk->bf = bf;
	blk->blkn = blkn;
	blk->len = len;
}

/*--------------------------------------------------------------
函数名称：BlkFromBytes
函数功能：从分块报文的字节流转换为分块结构体。
输入参数：buf-分块字节流数组指针
输出参数：blk-分块结构体指针
返回值：无
备 注：
---------------------------------------------------------------*/
void BlkFromBytes(UappsBlk_t *blk, u8 buf[])
{
	blk->bf = buf[0] >> 7;
	blk->blkn = (buf[0] & 0x7f) >> 3;
	blk->len = buf[0] & 0x07;
 	blk->len = (blk->len << 8) + (buf[1] & 0xff);
}

/**
 * Convert Block struct to bytes, return byte array length
 */
/*--------------------------------------------------------------
函数名称：Blk2Bytes
函数功能：从分块报文结构体转换为字节流。
输入参数：blk-待转换的分块结构体指针
输出参数：buf-转换后的字节流
返回值：无
备 注：
---------------------------------------------------------------*/
u8 Blk2Bytes(UappsBlk_t *blk, u8 buf[])
{
	buf[0] = (blk->bf << 7) + (blk->blkn << 3) + (u8)((blk->len >> 8) & 0x07);
	buf[1] = (u8)(blk->len & 0xff);

	return 2;
}

/**
 * Convert Block struct to option struct, return OK or error code
 */
/*--------------------------------------------------------------
函数名称：Blk2Option
函数功能：从分块报文结构体转换为分块选项。
输入参数：blk-待转换的分块结构体指针
        opt_code - 分块选项码
输出参数：opt-转换后的分块选项指针
返回值：无
备 注：
---------------------------------------------------------------*/
UappsError Blk2Option(UappsBlk_t *blk, u8 opt_code, UappsOption *opt)
{
	opt->opt_code = opt_code;
	opt->opt_len = Blk2Bytes(blk,opt->opt_val);

	return UAPPS_OK;
}
/***********************************函数声明 结束***********************************/
